tutorials/mixingTransportFoam/twoStreams/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
1.27775285252e-05
6.80775839249e-06
4.05896269065e-06
2.84113426724e-06
2.4007257213e-06
2.43958108268e-06
2.87319531092e-06
3.72459165892e-06
...
)
;

boundaryField
{
    inlet1
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
7.07617183052e-05
7.07617183048e-05
7.07617183045e-05
7.07617183044e-05
7.07617183043e-05
7.07617183042e-05
7.07617183042e-05
7.07617183042e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
)
;
    }
    inlet2
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183041e-05
7.07617183042e-05
7.07617183042e-05
7.07617183042e-05
7.07617183043e-05
7.07617183044e-05
7.07617183045e-05
7.07617183048e-05
7.07617183052e-05
)
;
    }
    outlet
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           nonuniform List<scalar> 
30
(
8.59836684998e-06
7.1277371765e-06
5.9852928112e-06
5.08767082318e-06
4.37677734346e-06
3.81160990342e-06
3.36295844527e-06
3.00985801575e-06
...
)
;
    }
    walls
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
